###############################################################
#  Generated by:      Cadence Encounter 13.13-s017_1
#  OS:                Linux x86_64(Host ID microelnsys)
#  Generated on:      Tue Oct 31 22:31:46 2017
#  Design:            top_level
#  Command:           saveDesign top_level.enc
###############################################################
current_design top_level
create_clock [get_ports {clock}]  -name CLK -period 1.700000 -waveform {0.000000 0.850000}
set_propagated_clock  [get_ports {clock}]
